[AHWElderRevived X2CharacterTemplate]
strCharacterName="Revived Ethereal"

[EtherealAutopsy X2TechTemplate]
DisplayName="<font color='#df07b7'>Ethereal Autopsy</font>"
Summary="Autopsy the Carcass of an Ethereal."
CodeName="<font color='#df07b7'>Fallen Gods</font>"
LongDescription="<font color='#df07b7'><Bullet/> Having finished the dissection, of the specimen, I must confess, I now have more questions than answers. The specimen in question, was affected by extreme muscular and tissue atrophy, and outright calcification of some of its organs, including the specimen’s heart. How the Elder in question was even alive, much less capable of enduring the immense amounts of firepower that was being used against it for as long as it did, still remains a mystery. \n <Bullet/> And yet, despite the truly immense Psionic prowess demonstrated by the Elder, its body shows next to no signs of it. Even deceased ADVENT Priests and Sectoids have significantly greater amounts of Psionic Energy than what remains in its body, which only furthers the mystery of the next part of our analysis of the Elder. \n <Bullet/> The Artifact, as one of my colleagues termed the helmet that the Elder was wearing, is composed of entirely unique metals, and do not match the properties of any known metal or alloy, even among the ones we’ve witnessed used so far by the aliens. Capable of storing and conducting astonishingly tremendous amounts of Psionic Energy, the exact purpose of it is unknown, but it is likely the reason that barely any Psionic Energy remains within the Alien’s carcass. \n <Bullet/> During the examination of the Artifact, however, several of the researchers, claimed to have heard a strange voice, whispering in the back of their minds. While I myself did not hear it, I believe that we should be extremely cautious when handling it.. Which leads me to my conclusion. \n <Bullet/> While we do not understand the exact purpose of The Artifact, it contains a beyond immense amount of Psionic Energy. Far more than any of our equipment has been designed to ever handle. However, with a combination of the Psionic technology used in our Psi Amps, and that of the Templars, it may be possible for even Soldiers with little Psionic Potential of their own to draw upon the immense power that lies within. However.. Given what happened during our initial examination of the object in question, there may be risks to doing so that we do not understand. - R. Tygan </font>"

[SacrificialPower X2AbilityTemplate]
LocFriendlyName="Sacrificial Power"
LocLongDescription="<Bullet/> Draw upon the power within the Elder's Crown, causing self damage and a stacking permanent stat penalty in exchange for a bonus action point as well as a damage bonus. \n <Bullet/> Killing any enemy while under the effects of Sacrificial Power refunds the Wielder an Action Point. \n <Bullet/> ALL of the Stat Increases and Decreases Stack with use, and last until the end of the mission. \n <Bullet/> Damage taken from this ability ignores armor, bypasses shields, and bypasses Sustain. \n <Bullet/> Sacrifical Power can still be used even after using up the Soldier's Action Points. \n <Bullet/>Overusing this ability will cause something very bad to happen."
LocHelpText="<Bullet/> Take self damage and a stacking permanent stat penalty in exchange for a bonus action point as well as a damage bonus. \n <Bullet/> Killing any enemy while under the effects of Sacrificial Power refunds the Wielder an Action Point. <Bullet/> Overusing this ability will cause something very bad to happen."
LocFlyOverText="Sacrificial Power"

[EtherealCrownInit X2AbilityTemplate]
LocFriendlyName="Anima Immortalis"
LocLongDescription="Revives the Fallen Elder."
LocHelpText="Revives the Fallen Elder."

[EtherealSpawnListener X2AbilityTemplate]
LocFriendlyName="Lorem Ipsum"
LocLongDescription="Revives the Fallen Elder."
LocHelpText="Revives the Fallen Elder."

[EtherealCrownKillSwitch X2AbilityTemplate]
LocFriendlyName="Deus Ex Mentis"
LocLongDescription="Revives the Fallen Elder."
LocHelpText="Deus Ex Mentis"

[EtherealCrownAPRefund X2AbilityTemplate]
LocFriendlyName="Lorem Ipsum"
LocLongDescription="Revives the Fallen Elder."
LocHelpText="Revives the Fallen Elder."

[EtherealRevival X2AbilityTemplate]
LocFriendlyName="Deus Ex Arma"
LocLongDescription="The Power of an Elder is dangerous to wield, and if its Wielder dies, something very bad will happen. Additionally, if a soldier equipped with an Ethereal Crown loses control of their mind, they will die."
LocHelpText="The Power of an Elder is dangerous to wield, and if its Wielder dies, something very bad will happen. Additionally, if a soldier equipped with an Ethereal Crown loses control of their mind, they will die."
LocFlyOverText="Deus Ex Arma: Elder Revived!"

[EtherealCrown X2EquipmentTemplate]
FriendlyName="<font color='#df07b7'>Ethereal Crown</font>"
FriendlyNamePlural="<font color='#df07b7'>Ethereal Crowns</font>"
BriefSummary="Allows the Wielder to draw upon the immense Psionic Power contained within the Elder's crown to surpass the limits of their humanity, however, doing so comes at a cost, and with risks."
TacticalText="Allows the Wielder to draw upon the immense Psionic Power contained within the Elder's crown to surpass the limits of their humanity, enabling them to freely Teleport to any location within sight. Additionally, allows the Wielder to channel the power of an Elder, at the cost of their own life force. If the Wielder of an Ethereal Crown is Mind Controlled something very bad will happen, and the Ethereal Crown will be permanently removed from the Soldier's Inventory."

[CorpseEthereal X2ItemTemplate]
FriendlyName="<font color='#df07b7'>Ethereal Carcass</font>"
FriendlyNamePlural="<font color='#df07b7'>Ethereal Carcasses</font>"
BriefSummary="The Carcass of a Fallen Elder."
